[
  {
      "text": "In a Flexbox container, the content flows along which axis?",
      "answers": [
          "main",
          "cross",
          "vertical",
          "horizontal"
      ]
  },
  {
      "text": "In a Flexbox container, which property controls how content is laid out on the cross axis?",
      "answers": [
          "justify-content",
          "justify-self",
          "align-items",
          "align-self"
      ]
  },
  {
      "text": "In a Flexbox container, which property defines the main axis?",
      "answers": [
          "flex-grow",
          "flex-wrap",
          "flex-gap",
          "flex-direction"
      ]
  },
  {
      "text": "Which CSS property is used to change the background color?",
      "answers": [
          "color",
          "bgcolor",
          "background-color",
          "color-background"
      ]
  },
  {
      "text": "Which CSS property is used to change the text size?",
      "answers": [
          "size",
          "font-size",
          "text-size",
          "fs"
      ]
  },
  {
      "text": "Which CSS selector should be used to select an element with an <code>id</code> of <code>'item'</code>?",
      "answers": [
          "item",
          ".item",
          "#item",
          "*item"
      ]
  },
  {
      "text": "What is the default value of the position property?",
      "answers": [
          "fixed",
          "absolute",
          "relative",
          "static"
      ]
  },
  {
      "text": "What property is used to define the number of columns in a CSS Grid?",
      "answers": [
          "grid-row",
          "grid-column",
          "grid-template-column",
          "column-count"
      ]
  },
  {
      "text": "In CSS Grid, what is the purpose of the <code>grid-template-areas</code> property?",
      "answers": [
          "To define the placement of items in the grid",
          "To set the background color of the grid",
          "To define the size of the grid",
          "To create a border around the grid"
      ]
  },
  {
      "text": "What is the purpose of the <code>minmax()</code> function in CSS Grid?",
      "answers": [
          "Specifies a minimum and maximum width for a column or row",
          "Defines the minimum and maximum number of items in a grid",
          "Sets a minimum and maximum font size for text in a grid",
          "Determines the minimum and maximum number of columns in a grid"
      ]
  },
  {
      "text": "What is the purpose of ARIA (Accessible Rich Internet Applications) in HTML?",
      "answers": [
          "To define font styles",
          "To enhance the accessibility of web content for people with disabilities",
          "To specify image sources",
          "To control the layout of web pages"
      ]
  },
  {
      "text": "What does the <code>role</code> attribute in HTML provide for accessibility?",
      "answers": [
          "Specifies the color scheme of an element",
          "Defines the role or purpose of an element for assistive technologies",
          "Sets the font size for an element",
          "Determines the position of an element on the page"
      ]
  },
  {
      "text": "How can you create a logical document structure for better accessibility in HTML?",
      "answers": [
          "Use only <code>&lt;div&gt;</code> elements for all content",
          "Use semantic HTML elements to represent the structure of the document",
          "Use inline styles for all formatting",
          "Avoid using headings and lists"
      ]
  },
  {
      "text": "What is the purpose of the <code>z-index</code> property in CSS?",
      "answers": [
          "Controls the stacking order of elements",
          "Sets the font size of the text",
          "Defines the spacing between elements",
          "Determines the width of the border"
      ]
  },
  {
      "text": "What is the main purpose of custom properties in CSS?",
      "answers": [
          "To store data in the browser's local storage",
          "To define and reuse values in CSS",
          "To create custom fonts for a website",
          "To implement conditional statements in stylesheets"
      ]
  }
]